{
  "services": [
    {
      "id": "web",
      "title": {
        "tr": "Web Geliştirme",
        "en": "Web Development"
      },
      "description": {
        "tr": "Modern web teknolojileri ile hızlı, güvenli ve ölçeklenebilir web uygulamaları geliştiriyoruz. Next.js, React ve Node.js ile tam kapsamlı çözümler.",
        "en": "We develop fast, secure, and scalable web applications with modern web technologies. Full-stack solutions with Next.js, React, and Node.js."
      },
      "icon": "Globe"
    },
    {
      "id": "mobile",
      "title": {
        "tr": "Mobil Uygulama",
        "en": "Mobile App"
      },
      "description": {
        "tr": "iOS ve Android için native performanslı, kullanıcı dostu mobil uygulamalar.",
        "en": "Native performance mobile applications for iOS and Android with user-friendly interfaces."
      },
      "icon": "Smartphone"
    },
    {
      "id": "uxui",
      "title": {
        "tr": "UI/UX Tasarım",
        "en": "UI/UX Design"
      },
      "description": {
        "tr": "Kullanıcı deneyimini ön plana alan, modern ve şık arayüz tasarımları.",
        "en": "Modern and elegant interface designs that prioritize user experience."
      },
      "icon": "Palette"
    },
    {
      "id": "backend",
      "title": {
        "tr": "Backend Sistemler",
        "en": "Backend Systems"
      },
      "description": {
        "tr": "Güçlü ve güvenilir API'lar, veritabanı tasarımı ve sunucu altyapısı.",
        "en": "Powerful and reliable APIs, database design, and server infrastructure."
      },
      "icon": "Database"
    },
    {
      "id": "security",
      "title": {
        "tr": "Güvenlik Danışmanlığı",
        "en": "Security Consulting"
      },
      "description": {
        "tr": "Penetrasyon testleri, güvenlik denetimleri ve en iyi güvenlik uygulamaları.",
        "en": "Penetration testing, security audits, and best security practices."
      },
      "icon": "Shield"
    }
  ],
  "projects": [
    {
      "id": "ecommerce-platform",
      "title": {
        "tr": "E-Ticaret Platformu",
        "en": "E-Commerce Platform"
      },
      "description": {
        "tr": "Tam özellikli online mağaza ve ödeme entegrasyonu.",
        "en": "Full-featured online store with payment integration."
      },
      "imageUrl": "https://images.unsplash.com/photo-1557821552-17105176677c?w=800&q=80",
      "link": "https://example.com",
      "fullDescription": {
        "tr": "Türkiye'nin önde gelen tekstil markalarından biri için geliştirdiğimiz bu e-ticaret platformu, ayda 100.000'den fazla ziyaretçiye hizmet vermektedir.\n\nPlatform, gelişmiş filtreleme, gerçek zamanlı stok takibi, çoklu ödeme seçenekleri ve kargo entegrasyonları ile donatılmıştır. Mobil uyumlu tasarımı sayesinde satışların %60'ı mobil cihazlardan gerçekleşmektedir.",
        "en": "This e-commerce platform developed for one of Turkey's leading textile brands serves over 100,000 visitors per month.\n\nThe platform is equipped with advanced filtering, real-time stock tracking, multiple payment options, and shipping integrations. Thanks to its mobile-friendly design, 60% of sales come from mobile devices."
      },
      "technologies": [
        "Next.js",
        "TypeScript",
        "PostgreSQL",
        "Stripe",
        "Redis",
        "AWS"
      ],
      "challenges": {
        "tr": "Yüksek trafik dönemlerinde (kampanya günleri) performans sorunları ve stok senkronizasyonu en büyük zorluklardı. Ayrıca mevcut ERP sistemiyle entegrasyon karmaşık bir süreçti.",
        "en": "Performance issues during high traffic periods (campaign days) and stock synchronization were the biggest challenges. Integration with the existing ERP system was also a complex process."
      },
      "solutions": {
        "tr": "Redis tabanlı önbellekleme ve CDN kullanarak performansı optimize ettik. Gerçek zamanlı stok senkronizasyonu için WebSocket bağlantıları kurduk. ERP entegrasyonu için özel API gateway geliştirdik.",
        "en": "We optimized performance using Redis-based caching and CDN. We established WebSocket connections for real-time stock synchronization. We developed a custom API gateway for ERP integration."
      },
      "gallery": [
        "https://images.unsplash.com/photo-1563013544-824ae1b704d3?w=800&q=80",
        "https://images.unsplash.com/photo-1472851294608-062f824d29cc?w=800&q=80",
        "https://images.unsplash.com/photo-1460925895917-afdab827c52f?w=800&q=80"
      ]
    },
    {
      "id": "finance-dashboard",
      "title": {
        "tr": "Finans Dashboard",
        "en": "Finance Dashboard"
      },
      "description": {
        "tr": "Gerçek zamanlı analitik ve raporlama araçları.",
        "en": "Real-time analytics and reporting tools."
      },
      "imageUrl": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?w=800&q=80",
      "link": "https://example.com",
      "fullDescription": {
        "tr": "Bir fintech şirketi için geliştirdiğimiz bu dashboard, finansal verilerin gerçek zamanlı takibini ve analizini sağlamaktadır.\n\nKullanıcılar gelir-gider takibi, nakit akışı analizi, bütçe planlaması ve tahminleme araçlarına tek bir platformdan erişebilmektedir. Otomatik rapor oluşturma ve e-posta bildirimleri ile iş süreçleri otomatize edilmiştir.",
        "en": "This dashboard developed for a fintech company provides real-time tracking and analysis of financial data.\n\nUsers can access income-expense tracking, cash flow analysis, budget planning, and forecasting tools from a single platform. Automatic report generation and email notifications have automated business processes."
      },
      "technologies": [
        "React",
        "D3.js",
        "Node.js",
        "MongoDB",
        "Socket.io",
        "Docker"
      ],
      "challenges": {
        "tr": "Büyük veri setlerinin gerçek zamanlı görselleştirilmesi ve farklı veri kaynaklarından gelen verilerin birleştirilmesi ana zorluklardı.",
        "en": "Real-time visualization of large data sets and combining data from different data sources were the main challenges."
      },
      "solutions": {
        "tr": "D3.js ile optimize edilmiş grafikler ve veri sanallaştırma (virtualization) teknikleri kullandık. Mikroservis mimarisi ile farklı veri kaynaklarını tek bir API'de topladık.",
        "en": "We used D3.js optimized charts and data virtualization techniques. We aggregated different data sources into a single API using microservice architecture."
      },
      "gallery": [
        "https://images.unsplash.com/photo-1460925895917-afdab827c52f?w=800&q=80",
        "https://images.unsplash.com/photo-1504868584819-f8e8b4b6d7e3?w=800&q=80",
        "https://images.unsplash.com/photo-1551288049-bebda4e38f71?w=800&q=80"
      ]
    },
    {
      "id": "social-app",
      "title": {
        "tr": "Sosyal Medya Uygulaması",
        "en": "Social Media App"
      },
      "description": {
        "tr": "Topluluk platformu ve mesajlaşma özellikleri.",
        "en": "Community platform with messaging features."
      },
      "imageUrl": "https://images.unsplash.com/photo-1611162617474-5b21e879e113?w=800&q=80",
      "link": "https://example.com",
      "fullDescription": {
        "tr": "Hobi grupları için geliştirdiğimiz bu sosyal medya uygulaması, kullanıcıların ilgi alanlarına göre gruplar oluşturmasını ve etkileşim kurmasını sağlamaktadır.\n\nGerçek zamanlı mesajlaşma, etkinlik oluşturma, fotoğraf/video paylaşımı ve bildirim sistemi ile kullanıcı deneyimini zenginleştirdik. App Store ve Play Store'da 4.8 yıldız puanına sahiptir.",
        "en": "This social media application developed for hobby groups enables users to create groups based on their interests and interact.\n\nWe enriched the user experience with real-time messaging, event creation, photo/video sharing, and notification system. It has a 4.8 star rating on the App Store and Play Store."
      },
      "technologies": [
        "React Native",
        "Firebase",
        "Node.js",
        "GraphQL",
        "AWS S3",
        "Push Notifications"
      ],
      "challenges": {
        "tr": "Gerçek zamanlı mesajlaşmada düşük gecikme süresi sağlamak ve medya dosyalarının hızlı yüklenmesi en büyük zorluklardı.",
        "en": "Ensuring low latency in real-time messaging and fast loading of media files were the biggest challenges."
      },
      "solutions": {
        "tr": "Firebase Realtime Database ve Cloud Functions kullanarak anlık mesajlaşma altyapısı kurduk. Medya dosyaları için CDN ve progressive loading uyguladık.",
        "en": "We built instant messaging infrastructure using Firebase Realtime Database and Cloud Functions. We implemented CDN and progressive loading for media files."
      },
      "gallery": [
        "https://images.unsplash.com/photo-1611162616305-c69b3fa7fbe0?w=800&q=80",
        "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?w=800&q=80",
        "https://images.unsplash.com/photo-1516251193007-45ef944ab0c6?w=800&q=80"
      ]
    }
  ],
  "messages": [
    {
      "id": "e5d1a75f-713a-4bda-ab17-d10927c46cb3",
      "date": "2025-11-25T15:38:33.097Z",
      "name": "Test User",
      "email": "test@example.com",
      "content": "This is a test message from the browser subagent."
    }
  ],
  "settings": {
    "siteName": {
      "tr": "Appykod",
      "en": "Appykod"
    },
    "siteDescription": {
      "tr": "Dijital çözümler",
      "en": "Digital solutions"
    },
    "logo": "/logos/Appy_white.svg",
    "contact": {
      "email": "info@appykod.com",
      "address": {
        "tr": "İstanbul, Türkiye",
        "en": "Istanbul, Turkey"
      },
      "address2": {
        "tr": "İzmir, Türkiye",
        "en": "Izmir, Turkey"
      }
    },
    "social": {}
  }
}